MEXICO/V9-Run7/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
//  default                        backward;
    default                        Euler;
}

gradSchemes
{
    default                        Gauss linear;
    grad(U)                        Gauss linear;
}

divSchemes
{
    default                        Gauss linear;
    div(phi,U)                     Gauss upwind;
    div(phi,T)                     Gauss upwind;
    div(R)                         Gauss upwind;
    div(U)                         Gauss upwind;
    div((nuEff*dev(grad(U).T())))  Gauss upwind;
    div(B)                         Gauss upwind;
    div(phi,B)                     Gauss upwind;
}

laplacianSchemes
{
    default                        Gauss linear corrected;
   // laplacian(rUA,p)               Gauss linear uncorrected;
   // laplacian((1|A(U)),p)          Gauss linear uncorrected;
   // laplacian(interpolate((1|A(U))),p) Gauss linear uncorrected;
   // laplacian(interpolate((1|A(U))),pd) Gauss linear uncorrected;
   // laplacian(nu,U)                Gauss linear uncorrected;
   // laplacian(nuEff,U)             Gauss linear uncorrected;
   // laplacian(kappaEff,T)          Gauss linear uncorrected;
   // laplacian(DBEff,B)             Gauss linear uncorrected;
   // laplacian(nuSgs,U)             Gauss linear uncorrected;
}

interpolationSchemes
{
    default                        linear;
}

snGradSchemes
{
    default                        uncorrected;
}

fluxRequired
{
    default                        no;
    p                               ;
}

schemeBlending
{
    xBlending1                     -252.0;
    xBlending2                        0.0;
    xBlending3                     3024.0;
    xBlending4                     4000.0;
    blendingFactor1                   0.9;
    blendingFactor2                   1.0;
}


// ************************************************************************* //
